#encoding=utf-8
import re

format_base = ['咨询-电费-过高','咨询-电量','咨询-电价','咨询-电费','报修-停电','营业厅-地址-咨询','装置-线路-故障','客户-重复-报修','设置-密码','咨询-发票-打印','咨询-抄表-日期','工作人员-态度-差','银行-代收-咨询','抄表-误差','短信-提醒','咨询-峰谷-电价']

dict1 = {
'咨询':['咨询','查询','询问','质询','查'],
'电费':['电费'],
'过高':['过高','偏高','高','增高','突增','增多','过多','升高','突高','高于','变高','明显增加','多倍'],
'电量':['电量'],
'电价':['电价','单价','价格','资费'],
'报修':['报修'],
'故障':['故障','表不亮','线烧','无显示','已烧','短路','烧毁'],
'停电':['停电'],
'客户':['客户','用户','居民','非居民','户民','顾客'],
'营业厅':['营业厅','营业网点','营业点'],
'地址':['地址','具体地址'],
'装置':['装置','电表','点表','采集器','互感器','终端','接收器','表计'],
'线路':['线路','电线','进户线','接户线','电路','线头','电缆线','母线','接线柱','表线','户线','高压线','输电线','排线','连接处','铜丝','熔丝'],
'重复':['重复','同工单','合并','已派','前次','催办','同单'],
'设置':['设置','初始化','初始'],
'发票':['发票','普通发票','专用发票'],
'打印':['打印','打印发票','清单','传真','开具'],
'日期':['日期','周期','截止日','周期时间','起止日期'],
'工作人员':['人员','师傅','公司员工','施工人员'],
'态度':['态度','语气','认真负责','热情','认真','服务态度','细致','友好','蛮横','生硬','熟练','积极'],
'差':['差','不好','很差','冷漠','不耐烦','不佳','语气','辱骂','较差','冷淡','生硬','强硬','争吵','蛮横','嘈杂','极差','听不清','不太好','脏话','恶劣','不号','谩骂','较弱','听不见','答非所问','断断续续','推诿'],
'银行':['银行','建设银行','工商银行','银行卡','招商银行','邮储','招行','邮政储蓄','建行','交通银行','邮政','网上支付','分行','农业银行','存折','工商','华夏银行','中国农业银行','交行','民生银行','中国银行','中信银行','农行','中国工商银行','工行','中国民生银行','中国建设银行','浦发银行'],
'密码':['密码','初始化','初始密码'],
'代收':['代收','代缴','代售点','代收','代售','代购','代交','代扣','代收费','缴纳'],
'抄表':['抄表','超表','月表','示数','实数'],
'短信':['短信','短信息','手机短信','短信内容','提醒','发送信息','订阅'],
'误差':['误差','相减','差额','微小','等于','远大于','准确度','差距','相差','少抄','相差太大','差别','多现','铁损','多度','远远','多多','少于'],
'提醒':['提醒','短信','终止','取消','发错','错发','发件','错收','接收','催费','订阅','催缴','催缴单','订购','退订','收到','催交','催费单'],
'峰谷':['峰谷','峰时','分谷','时段','谷时','为峰','分时','峰','谷','谷峰','平谷','峰值','亮谷','为谷','峰灯','谷灯']
}

f1 = open('/Users/wdw/Desktop/work/data/data.txt','r')
f2 = open('/Users/wdw/Desktop/work/data/sat_word1.txt','w')
res = open('/Users/wdw/Desktop/work/data/data_format.txt','w')

obj = {}   #词频统计字典

for line in	f1.readlines():
	string = ''
	for word1 in format_base:
		n=0
		word1_list = word1.split('-')
		for word2 in word1_list:
			word2_str = '|'.join(dict1[word2])
			if len(re.findall(word2_str,line)):
				n +=1
		if n == len(word1.split('-')):
			string += word1 + '\t'
			if obj.has_key(word1):
				obj[word1] += 1
			else:
				obj[word1] = 0
	if len(string):
		res.write(string + '\n')

for o in obj:
	f2.write(o + '\t' + str(obj[o]) + '\n')

res.close()
f1.close()
f2.close()
