#encoding=utf-8
import re
import time

format_base = [{'咨询':['咨询-电费-过高','咨询-电量','咨询-电价','咨询-电费','咨询-营业厅-地址','咨询-发票-打印','咨询-银行-代收','咨询-抄表-日期','咨询-电表-效验','咨询-电表-轮换','咨询-电表-改进','咨询-表计-事宜','咨询-采集-装置','咨询-负控-装置','咨询-峰谷-电价','咨询-负控-购电','咨询-表箱-故障','咨询-线路-故障','咨询-计划-停电','咨询-故障-停电','咨询-临时-停电','咨询-大面积-停电','咨询-停电-发布','咨询-有序-用电','咨询-电价-政策','咨询-阶梯-电价','咨询-抄表-收费','咨询-电费-退补','咨询-预购电','咨询-电费-账单','咨询-电费-转账','咨询-应缴-电费','咨询-逾期-电费','咨询-欠费-停电','咨询-复电-事宜']},
{'故障报修':[]}
]


dict1 = {
'咨询':['咨询','查询','询问','质询','核实','核实'],
'电费':['电费','费','月费','查月费'],
'过高':['过高','偏高','高','增高','突增','增多','过多','升高','突高','高于','变高','明显增加','多倍'],
'电量':['电量','使用量','用电量'],
'电价':['电价','单价','价格','资费'],
'营业厅':['营业厅','营业网点','营业点'],
'地址':['地址','具体地址'],
'装置':['装置','电表','点表','采集器','互感器','终端','接收器','表计'],
'线路':['线路','电线','进户线','接户线','电路','线头','电缆线','母线','接线柱','表线','户线','高压线','输电线','排线','连接处','铜丝','熔丝'],
'设置':['设置','初始化','初始'],
'发票':['发票','普通发票','专用发票'],
'打印':['打印','打印发票','清单','传真','开具'],
'日期':['日期','周期','截止日','周期时间','起止日期'],
'工作人员':['人员','师傅','公司员工','施工人员'],
'态度':['态度','语气','认真负责','热情','认真','服务态度','细致','友好','蛮横','生硬','熟练','积极'],
'不好':['不好','很差','冷漠','不耐烦','不佳','语气','辱骂','较差','冷淡','生硬','强硬','争吵','蛮横','嘈杂','极差','听不清','不太好','脏话','恶劣','不号','谩骂','较弱','听不见','答非所问','断断续续','推诿'],
'银行':['银行','建设银行','工商银行','银行卡','招商银行','邮储','招行','邮政储蓄','建行','交通银行','邮政','网上支付','分行','农业银行','存折','工商','华夏银行','中国农业银行','交行','民生银行','中国银行','中信银行','农行','中国工商银行','工行','中国民生银行','中国建设银行','浦发银行'],
'密码':['密码','初始化','初始密码'],
'代收':['代收','代缴','代售点','代收','代售','代购','代交','代扣','代收费','缴纳'],
'抄表':['抄表','超表','月表','示数','实数'],
'误差':['误差','相减','差额','微小','等于','远大于','准确度','差距','相差','少抄','相差太大','差别','多现','铁损','多度','远远','多多','少于'],
'提醒':['提醒','短信','终止','取消','发错','错发','发件','错收','接收','催费','订阅','催缴','催缴单','订购','退订','收到','催交','催费单'],
'峰谷':['峰谷','峰时','分谷','时段','谷时','为峰','分时','峰','谷','谷峰','平谷','峰值','亮谷','为谷','峰灯','谷灯'],
'电表':['电表','新表','表计','表','户表'],
'效验':['效验','检验','复验'],
'轮换':['轮换','换表','更换','换装','换标','时漏'],
'改进':['改进'],
'有序':['有序'],
'用电':['用电','用点'],
'表计':['表计','标记'],
'事宜':['事宜','事项','问题','常识','信息'],
'采集':['采集','采集器','集抄器','集抄线','集抄'],
'负控':['负控','负控终端'],
'谷峰':['谷峰','峰时','峰','分谷'],
'购电':['购电','预购','电购','充值','预交','缴费','缴款','预付费','网上支付','转账支票','缴纳'],
'反映':['反映','放映','咨询','反应'],
'表箱':['表箱','外壳','表壳','箱盖','表盖','箱体'],
'线路':['线路','表前线路','表线','进户线','线体','主线','排线','引线','电缆线','高压线'],
'计划':['计划'],
'临时':['临时'],
'停电':['停电','多户停电','听电'],
'故障':['故障','损坏','短路','已损坏','缺损','损毁','锈蚀','烧坏','年久失修'],
'大面积':['发布','一带','工业园'],
'发布':['发布','渠道','刊登','晚报','南京日报','公布','新闻','报刊'],
'限电':['限电'],
'错峰':['错峰',],
'政策':['政策','档次','分档','各档','档数',],
'阶梯':['阶梯'],
'收费':['收费','费用','资费','验表费','卡拉卡'],
'发票':['发票','票','增值税','税','普通发票','专用发票','开票','开据','开具','小票','税票','开发票','凭据','明细单'],
'退补':['退补','多收','退还','多交','差额','差价','补缴','补交','多算','错交'],
'预购电':['预购电'],
'账单':['账单','清单'],
'转账':['转账','汇款','电汇','打款','网银'],
'应缴':['应缴','应交','需缴'],
'逾期':['逾期','延期','滞纳金','超期',],
'欠费':['欠费','未交','停电通知书'],
'复电':['复电','复点']
}

f1 = open('/Users/wdw/Desktop/work/data/data.txt','r')
f2 = open('/Users/wdw/Desktop/work/data/sat_word1.txt','w')
res = open('/Users/wdw/Desktop/work/data/data_format.txt','w')

obj = {}   #词频统计字典
first = time.time() #运行时间

for line in	f1.readlines():
	string = ''
	for word1 in format_base:
		n=0
		word1_list = word1.split('-')
		for word2 in word1_list:
			if not dict1.has_key(word2):
				print "******" + word2 + "******" + "\n"
			word2_str = '|'.join(dict1[word2])
			if len(re.findall(word2_str,line)):
				n +=1
		if n == len(word1.split('-')):
			string += word1 + '\t'
			if obj.has_key(word1):
				obj[word1] += 1
			else:
				obj[word1] = 0
	if len(string):
		res.write(re.sub('\n','',line) + "--->>" + string + '\n')

for o in obj:
	f2.write(o + '\t' + str(obj[o]) + '\n')

res.close()
f1.close()
f2.close()

last = time.time()

print '该程序运行了%d秒' %int(last - first)